NextFOAM-2506/tutorials/incompressible/pimpleFoam/laminar/inclinedPlaneFilm/system/finite-area/faMeshDefinition
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      faMeshDefinition;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

polyMeshPatches ( film );

boundary
{
    inlet
    {
        type patch;
        //ownerPolyPatch      film;
        neighbourPolyPatch  inlet;
    }

    outlet
    {
        type patch;
        //ownerPolyPatch      film;
        neighbourPolyPatch  outlet;
    }

    side
    {
        type patch;
        //ownerPolyPatch      film;
        neighbourPolyPatch  side;
    }

    symmetry
    {
        type patch;
        //ownerPolyPatch      film;
        neighbourPolyPatch  bottom;
    }

    cylinder
    {
        type patch;
        //ownerPolyPatch      film;
        neighbourPolyPatch  cylinder;
    }
}


// ************************************************************************** //
